---
kind: other
id: Properties.T:Autodesk.Revit.DB.Events.RevitEventArgs
source: html/cb122f68-d2ec-a4fe-9d57-77cec31200e7.htm
---
# RevitEventArgs Properties

Indicates whether the event is being cancelled.
When the event is cancellable, set the property to True to cancel it.